{"review":"Rocketship X-M should be viewed by any serious movie buff for the following reasons:<br \/><br \/>1) It is one the first -- and the few -- movies not to have a happy ending. Doubtless the effect was more profound in post-World War II America than it would be today, but nonetheless the sad ending adds to the film's message.<br \/><br \/>2) It is also one of the first movies to deal with space travel in a serious fashion, using space as a valid setting for drama. The lack of scientific background notwithstanding, the movie stands on its own as dramatic fare. It's not so much a space drama as it is a drama set in space.<br \/><br \/>3) The anti-nuclear war message is delivered in a serious manner that is not lost in sfx involving large grasshoppers, men, or animal. The effect of Martian society from nuclear devastation is starkly and frankly presented. The fact that the survivors from the expedition crash land and as such are unable to preach the lesson learned on Mars adds another element of sadness to the tragic ending.<br \/><br \/>Sterno says take a ride on Rocketship X-M.","label":0,"predicted":1}
{"review":"I like this movie and have watched my copy twice since acquiring it a few weeks ago. But you have to view it in the right context.<br \/><br \/>I haven't checked on the dates, but I bet this movie came out after and certainly around the same time as the Collier and Walt Disney popularisations of the vision of spaceflight being promoted by W.Von Braun. This is reflected in the attempt to seem factually correct and scientific. However, whilst certain ideas are put across ( step boosters, for example ) roughly correctly, other things are hilariously wrong.<br \/><br \/>For example, we are told that a rocket ascends to an altitude and then turns ninety degrees to enter space...like reaching the top of a flight of stairs and turning onto the landing! Then we are told that by turning in the direction of the Earths rotation the total velocity of the ship is increased accordingly.<br \/><br \/>This is an hilarious misunderstanding of what really happens. Most space launch centres are located as near the equator as possible where the Earth and anything on its surface is rotating at roughly a thousand miles per hour, including any rocket departing to space, in an Eastward direction ( the same as the rotation of the planet ). Of course, if the ship turned to travel westwards once in space, its speed in relation to the surface of the Earth would be greater, but it would add nothing to the actual velocity of the vehicle. Decsribed in this movie as \"air speed\"! <br \/><br \/>Similarly, we are told that the travellers only feel free-fall, or \"weightlessness\" when they reach some thousands of miles from the Earth, outside of the planets gravitational field. Again, comically incorrect. Most crewed spacecraft travel no higher than a couple of hundred miles up, but as long as they ( and, their contents, including crew ) are travelling at an adequate velocity that their momentum in an outward direction balances the pull of gravity inwards, they will orbit in free-fall. Of course, travel far enough from Earth and even a slow object will coast outside the Earths gravity well, but in order to leave Earth orbit, outwards ( towards the Moon for example ) requires the attainment of \"escape velocity\", around twenty one thousand miles per hour. So the vehicle will have already attained \"orbital velocity\" ( and \"weightlessness\" ) by definition.<br \/><br \/>But the movie has vastly more hilarious stuff than this. Someone decided it would be more fun if they missed the moon due to a technical problem, fell asleep for a few days and then woke up to find they had accidentally gone to Mars! The captain then ruminates to the effect that this must have been divine intervention! At which point, any pretence to being scientific is torn into little pieces like confetti and thrown upon the wind amid the merry dance of an increasingly barmy plot.<br \/><br \/>The strength of a film like this in fact is in illustrating \"how far we've come\". Not least in attitudes to women. The patronising drivel heaped upon the female crew-member is both hilarious and also shocking.To think that such attitudes were so recently \"normal\".<br \/><br \/>As I said at the start, I find this film very entertaining, as a late night, lights out romp through the romance of travel in outer space, from the perspective of the days before it had actually happened. An antidote to the cold routine of spaceflight as it has now become in the Twenty First Century.<br \/><br \/>I won't reveal the ending. It is both brave and shocking for a movie of this vintage and character.","label":0,"predicted":1}
{"review":"I saw this film purely by chance. It was shown very late, or more correctly very early one morning on television. I had woken up and was having trouble getting to sleep and this film came on.<br \/><br \/>It deals with a subject covered many times elsewhere (it certainly isn't as good as Educating Rita, despite a couple of additional twists) and has a very predictable ending.<br \/><br \/>Despite its very obvious shortcomings I did enjoy the film and this was thanks to the acting of some of its players rather than the story or the piece as a whole.<br \/><br \/>I am a big fan of Sam Neil and have seen him in many different films including: Dead Calm; The Piano; Sirens; Children of the Revolution; Event Horizon; Bicentennial Man and the ubiquitous Jurassic Park. He was very good but he could have played this part with his eyes shut.<br \/><br \/>Some of the acting was, in my opinion, dreadful Rose Byrne for example and some of the elusions were rather heavy handed (all the board woman in empty lives all dressed totally in white for example).<br \/><br \/>However, two actors (who I hadn't, or don't remember, seen before) impressed me a lot Sinéad Cusackn as Frances (Frank) Kennedy, and especially Matthew Newton as her son David. He, in particular, was very convincing and I would like to see a lot more of him.","label":1,"predicted":0}
{"review":"An intelligent summation of Cold War era mutually assured destruction policy, up until the conclusion: it's a gasser! All Russians and Chinese are obliterated from the face of the Earth! Saw this one at the 27th Annual CWRU Science Fiction Marathon, January 2002.","label":0,"predicted":1}
{"review":"This is another film where the cinematography is the best thing to recommend it. That would be fine if the film were a travelogue, but as a dramatic exercise in cinematic artistry, that is not good enough. The theme of inter-species respect and co-operation ventures timidly into the forbidden world of inter-species love, but its approach is stereotypical, indicating a lack of understanding of the behavior motives of either species. As with many films, one always wonders what could have been achieved by a more innovative director and a more creative screenwriter. Alas, we probably will never know.","label":1,"predicted":0}
{"review":"<br \/><br \/>Average adventure movie that took a serious story and \"Holywoodised\" it.The watering down effect done particularly towards the average script snatched away this movie's place as a would be solid classic. Why water down such a great storyline?Probably because it deals with \"sensitive\" colonial subject matters and the producers do not want to create political heat,just quick profits thank you.The directing,cinematography and soundtrack and acting was good.The screenplay was average.The charm of Connery made up for his wrong Arabic accent and all the scenes with President T. Roosevelt were masterpiece takes.The costumes\/sets here was very good.Too bad we did not get more of a serious historical drama since this is what the story demands.Only for big fans of the lead actors or fans of exotic Romance\/Adventure Holywood movies.....","label":1,"predicted":0}
{"review":"You can generally ask two questions concerning 80's low-budget horror films. and this `Demon Wind' in particular. 1. Is it a good film? No.. 2. Is it a fun film?? You bet! Demon Wind is a gruesomely filthy and nauseating tale, filled with cheesy make-up effects and nasty violence. The story is pretty much non-existent and involves a group of young people revealing the horrible secrets of one of the groups' ancestors. Apparently, his grandparents used to live in a devil-worshiping neighborhood, and evil (in the form of demons and fog) still dwells around there. But, I got to hand it to this film.from start to finish, it breathes morbidity! The diabolical undertones, the playful gore and the (relatively) decent acting all together make this film raise high above the mainstream, uninspired 80's slashers for sure. It shows some creativity and guts (literally) where other productions from this decade fall into routine and oblivion more easily. This creators clearly got inspired by the success of `the Evil Dead', and perhaps even Lamberto Bava's `Demons, but what the heck! It's fun and made with lots of enthusiasm. Although.this film does have a pretty high `what the f***'- standard at times. Especially near the end, when flashbacks and laser shows are happily being mixed. And what the hell is the story on those two wannabe magicians? Nonetheless, `Demon Wind' gets my recommendation if your likes aren't too high concerning crap horror!","label":0,"predicted":1}
{"review":"Maybe I saw a cleaned up version, but other than a few flashes of breasts, I'm not sure what over the top nudity these other commenters are referring to.<br \/><br \/>All in all not as bad as I was expecting by the previous comments, although the end leaves you wondering ... WTF? It was dark, but not so much that you couldn't make out the scenes, and I think it just added to the creepiness and the terror of the situation.<br \/><br \/>Film quality could have been better, but the acting was pretty decent.<br \/><br \/>All in all a decently creepy (and yes, brutal) movie with a disappointing ending.","label":0,"predicted":1}
{"review":"I don't usually like TV movies, I reckon that if the thing was any good it would make it to Hollywood. This one though is better than average, pretty high production values, a few interesting story twists and some nice shots of NYC (along with Toronto) hold the interest.","label":0,"predicted":1}
{"review":"Lady and the Tramp II is very colourfully animated, and the songs, especially that of the Junkyard Dogs, are quite good. However, the family seems even too idyllic, and I can't help understanding that Scamp is discontented when everything is forbidden. However, I also pity Angel who never has had a loving family until she meets Jim dear and Darling.<br \/><br \/>In any case, it's clear that the original Lady and the Tramp is better than this sequel.","label":1,"predicted":0}
